Revit 2027 API
SpecTypeId.Reference.LoadClassification Property
 Load Classification, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LoadClassification { get; }
Public Shared ReadOnly Property LoadClassification As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LoadClassification {
	ForgeTypeId^ get ();
}
static member LoadClassification : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId.Reference Class
Autodesk.Revit.DB Namespace